import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

nan = np.nan

# 軸の定義
C_list = [r'$10^{-1}$', r'$10^{-\frac{1}{2}}$', r'$10^{0}$', r'$10^{\frac{1}{2}}$', r'$10^{1}$']
C_list = [r'$-1$', r'$-0.5$', r'$0$', r'$0.5$', r'$1$']
r_list = [r'$0.05$', r'$0.1$', r'$0.15$', r'$0.2$', r'$0.25$', r'$0.3$', r'$0.35$', r'$0.4$', r'$0.45$', r'$0.5$']

# 2次元配列 Z
Z = np.array([
    [0.999629165, 0.999494170, 0.998828168, 0.994692240, 0.984214900],
    [0.998918613, 0.998475455, 0.994920789, 0.983369291, 0.964337166],
    [0.997954469, 0.996788472, 0.990444301, 0.973756696, 0.936067391],
    [0.996807663, 0.994605132, 0.985892756, 0.960020574, 0.911878769],
    [0.995528080, 0.992469924, 0.980352932, 0.947046385, 0.878147831],
    [0.994385152, 0.991569597, 0.976833992, 0.939551811, 0.850301175],
    [0.993036569, 0.988261739, 0.973141951, 0.936797776, 0.850429983],
    [0.991395553, 0.984879366, 0.968617459, 0.935937725, 0.830593615],
    [0.990533268, 0.983368856, 0.964588389, 0.928002730, 0.797536787],
    [0.989385192, 0.980321408, 0.961404236, 0.920547796, 0.784266477]
])

# 3. ヒートマップの描画
plt.figure(figsize=(5, 3))
ax = sns.heatmap(
    Z, 
    xticklabels=C_list, 
    yticklabels=r_list, 
    cmap='Blues', 
    annot=True, 
    fmt=".4f", 
    cbar=True,
    vmin=0.75,   # グラデーションの最小値
    vmax=1.0    # グラデーションの最大値
)

plt.xlabel(r'$\log_{10} C$')
plt.ylabel(r'$r$')
#plt.title('Heatmap of Z (r vs C)')

# 縦軸を反転
ax.invert_yaxis()

# カラーバーの目盛りを消す
#ax.collections[0].colorbar.ax.set_yticks([])

# ↓【これをつける】はみ出しを自動調整
plt.tight_layout()

plt.show()